# Encoding
1) Label encoder ---> first find no of cate ...assign alphabetical order

In [1]:
#pip install scikit-learn
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
x=["red","blue","green"]                
#fit                                    --- alphabetical order
le.fit(x)
print(le.classes_)

['blue' 'green' 'red']

In [2]:
print(le.transform(["red"]))       # its gives the number
print(le.transform(["blue"]))
print(le.transform(["green"]))
#print(le.transform(["yellow"]))

[2]
[0]
[1]

In [3]:
print(le.transform(x))

[2 0 1]

In [4]:
# inverse Transform
print(le.inverse_transform([0]))

['blue']

In [5]:
print(le.fit_transform(x))

[2 0 1]

In [6]:
from sklearn.preprocessing import LabelEncoder
import pandas as pd
df=pd.read_csv("C:\\Users\\Krishna\\Desktop\\dataset\\titanic_train.csv")
df

,passenger_id,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,survived
0,1216,3,"Smyth, Miss. Julia",female,NaN,0,0,335432,7.7333,NaN,Q,13,NaN,NaN,1
1,699,3,"Cacic, Mr. Luka",male,38.0,0,0,315089,8.6625,NaN,S,NaN,NaN,Croatia,0
2,1267,3,"Van Impe, Mrs. Jean Baptiste (Rosalie Paula Go...",female,30.0,1,1,345773,24.1500,NaN,S,NaN,NaN,NaN,0
3,449,2,"Hocking, Mrs. Elizabeth (Eliza Needs)",female,54.0,1,3,29105,23.0000,NaN,S,4,NaN,"Cornwall / Akron, OH",1
4,576,2,"Veal, Mr. James",male,40.0,0,0,28221,13.0000,NaN,S,NaN,NaN,"Barre, Co Washington, VT",0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
845,158,1,"Hipkins, Mr. William Edward",male,55.0,0,0,680,50.0000,C39,S,NaN,NaN,London / Birmingham,0
846,174,1,"Kent, Mr. Edward Austin",male,58.0,0,0,11771,29.7000,B37,C,NaN,258.0,"Buffalo, NY",0
847,467,2,"Kantor, Mrs. Sinai (Miriam Sternin)",female,24.0,1,0,244367,26.0000,NaN,S,12,NaN,"Moscow / Bronx, NY",1
848,1112,3,"Peacock, Miss. Treasteall",female,3.0,1,1,SOTON/O.Q. 3101315,13.7750,NaN,S,NaN,NaN,NaN,0
849,425,2,"Greenberg, Mr. Samuel",male,52.0,0,0,250647,13.0000,NaN,S,NaN,19.0,"Bronx, NY",0

In [7]:
print(df.isna().sum())

passenger_id      0
pclass            0
name              0
sex               0
age             174
sibsp             0
parch             0
ticket            0
fare              1
cabin           659
embarked          1
boat            542
body            777
home.dest       386
survived          0
dtype: int64

In [8]:
df["age"]=df["age"].fillna(df["age"].median())
df["name"]=df["name"].fillna("u")
#df["embarked"]=df["embarked"].fillna("u")
df["cabin"]=df["cabin"].fillna(method="pad")
df["fare"]=df["fare"].fillna("u")
df["boat"]=df["boat"].fillna(0)
df["body"]=df["body"].fillna(df["body"].median())
df["home.dest"]=df["home.dest"].fillna("u")

In [9]:
print(df.isna().sum())

passenger_id     0
pclass           0
name             0
sex              0
age              0
sibsp            0
parch            0
ticket           0
fare             0
cabin           10
embarked         1
boat             0
body             0
home.dest        0
survived         0
dtype: int64

In [10]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
df=pd.read_csv("C:\\Users\\Krishna\\Desktop\\dataset\\titanic_train.csv")
df["embarked"]=df["embarked"].fillna(df["embarked"].mode()[0])
df[["embarked"]]=df[["embarked"]].apply(le.fit_transform)
print(df["embarked"])

0      1
1      2
2      2
3      2
4      2
      ..
845    2
846    0
847    2
848    2
849    2
Name: embarked, Length: 850, dtype: int32

In [ ]:
#s=2,m=1,l=1,xL=3,XLL=4    o-n-1=0-4

In [ ]:
india,Japan,australia,usa

In [1]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
x=["india","japan","australia","usa"]                
#fit                                    --- alphabetical order
le.fit(x)
print(le.classes_)

['australia' 'india' 'japan' 'usa']

In [2]:
print(le.transform(["india"]))       # its gives the number
print(le.transform(["japan"]))
print(le.transform(["australia"]))
print(le.transform(["usa"]))

[1]
[2]
[0]
[3]

In [ ]:
# OneHot Encoding
#                blue  green   red
#red              0      0      1
#green            0      1      0
#blue             1      0      0

#                L    M     S      Xl      XLL  
#S               0    0     1      0        0
#M               0    1     0      0        0
#L               1
#xL                                1
#XLL                                        1

In [4]:
from sklearn.preprocessing import OneHotEncoder
import pandas as pd
d={"data":["red","green","blue"]}
df=pd.DataFrame(d)
oh=OneHotEncoder()
print(oh.fit_transform(df[["data"]]))            # position display in array

  (0, 2)	1.0
  (1, 1)	1.0
  (2, 0)	1.0

In [5]:
print(oh.fit_transform(df[["data"]]).toarray())               # toarray will be provide matrics

[[0. 0. 1.]
 [0. 1. 0.]
 [1. 0. 0.]]

In [ ]:
# Variance inflaction factor
# VIF<5   (This is the moderate)
# VIF>5   (eitherwise Encoding ka ek column drop krdo)